Catalogs/упСервераСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСервераСбораДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипСервераСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытияМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Comment>AutoGRAPH</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьВQRКодДанныеАутентификацииНаМобильномКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыСлужбыПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПолученияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтсрочкиПолученияДанныхПоСобытиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПолученияТокен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипСервераСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипСервераСбораДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AndroidКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AutoGRAPH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WialonPro</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WialonHosting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСервераСбораДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если Объект.Тип = Перечисления.упТипСервераСбораДанных.AndroidКлиент Тогда 
		ПолучитьКартинкуШК();
	Иначе
		Элементы.Картинка.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.AndroidКлиент") Тогда 
		ПолучитьКартинкуШК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.AndroidКлиент") Тогда 
		ПолучитьКартинкуШК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кмдПолучитьСхемы(Команда)
	
	ПолученныеСхемы = ПолучитьСписокСхемСервиса();
	Если ТипЗнч(ПолученныеСхемы) = ТИП("Массив") Тогда
		Элементы.Схема.СписокВыбора.Очистить();
		Элементы.Схема.СписокВыбора.ЗагрузитьЗначения(ПолученныеСхемы);
		
		Если Элементы.Схема.СписокВыбора.Количество() > 0 Тогда 
			Объект.Схема = Элементы.Схема.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кмдПолучитьТССКАУТ(Команда)
	
	Если Объект.Сервер = "" ИЛИ Объект.Порт = 0 Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Scout SOAP'"),,
		НСтр("ru = 'Не настроены параметры подключения к серверу сбора данных.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Пользователь) Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Scout SOAP'"),,
		НСтр("ru = 'Не указан пользователь.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	ТекущийДокумент = Неопределено;
	ПолучитьТСНаСервереСКАУТ(ТекущийДокумент);
	Если НЕ ТекущийДокумент = Неопределено Тогда 
		ТекущийДокумент.Показать("Объекты мониторинга в СПИК");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТСOMNICOMM(Команда)
	
	Если Объект.Сервер = "" ИЛИ Объект.Порт = 0 Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Omnicomm SOAP'"),,
		НСтр("ru = 'Не настроены параметры подключения к серверу сбора данных.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Пользователь) Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Omnicomm SOAP'"),,
		НСтр("ru = 'Не указан пользователь.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	ТекущийДокумент = Неопределено;
	ПолучитьТСНаСервереOmnicomm(ТекущийДокумент);
	Если НЕ ТекущийДокумент = Неопределено Тогда 
		ТекущийДокумент.Показать("Объекты мониторинга в OMNICOMM");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТСWialonPro(Команда)
	
	Если Объект.Сервер = "" ИЛИ Объект.Порт = 0 Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от WialonPro'"),,
		НСтр("ru = 'Не настроены параметры подключения к серверу сбора данных.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Пользователь) Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от WialonPro'"),,
		НСтр("ru = 'Не указан пользователь.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ВыполнитьОбращениеНаСервереWialonPro", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Получение данных списка объектов сервера сбора данных может занять длительное времени продолжить обращения к сервису?'");
	ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТСWialonHosting(Команда)
	
	Если Объект.Сервер = "" ИЛИ Объект.Порт = 0 Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от WialonHosting'"),,
		НСтр("ru = 'Не настроены параметры подключения к серверу сбора данных.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Токен) Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от WialonHosting'"),,
		НСтр("ru = 'Не указан Токен.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ВыполнитьОбращениеНаСервереWialonHosting", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Получение данных списка объектов сервера сбора данных может занять длительное времени продолжить обращения к сервису?'");
	ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0); 
	
КонецПроцедуры // ПолучитьТСWialonHosting()

&НаКлиенте
Процедура СопоставитьТрекерыWialonPro(Команда)
	
	ЭтотТипОбъекта = ОпределитьТипСервераСбораДанных(Объект.Тип);
	
	Если Объект.Сервер = "" ИЛИ Объект.Порт = 0 Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Wialon'"),,
		НСтр("ru = 'Не настроены параметры подключения к серверу сбора данных.'"),БиблиотекаКартинок.Информация32);
		Возврат;
	КонецЕсли;
	
	Если ЭтотТипОбъекта.WialonPro Тогда 
		Если ПустаяСтрока(Объект.Пользователь) Тогда 
			ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от Wialon Pro'"),,
			НСтр("ru = 'Не указан пользователь.'"),БиблиотекаКартинок.Информация32);
			Возврат;
		КонецЕсли;
	ИначеЕсли ЭтотТипОбъекта.WialonHosting Тогда 
		Если ПустаяСтрока(Объект.Токен) Тогда 
			ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных от WialonHosting'"),,
			НСтр("ru = 'Не указан Токен.'"),БиблиотекаКартинок.Информация32);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыПолученияТокен = Новый Структура();
	ПараметрыПолученияТокен.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыПолученияТокен.Вставить("Тип", Объект.Тип);
	ПараметрыПолученияТокен.Вставить("ЗащищенноеСоединение", Объект.ЗащищенноеСоединение);
	ПараметрыПолученияТокен.Вставить("Сервер", Объект.Сервер);
	ПараметрыПолученияТокен.Вставить("Порт", Объект.Порт);
	ПараметрыПолученияТокен.Вставить("Пользователь", Объект.Пользователь);
	ПараметрыПолученияТокен.Вставить("Пароль", Объект.Пароль);
	ПараметрыПолученияТокен.Вставить("Токен", Объект.Токен);
	
	ОткрытьФорму("Справочник.упСервераСбораДанных.Форма.ФормаЗаполненияТрекеров", ПараметрыПолученияТокен,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // СопоставитьТрекерыWialonPro()

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	
	ПараметрыПолученияТокен = Новый Структура();
	ПараметрыПолученияТокен.Вставить("Тип", Объект.Тип);
	ПараметрыПолученияТокен.Вставить("ЗащищенноеСоединение", Объект.ЗащищенноеСоединение);
	ПараметрыПолученияТокен.Вставить("СерверПолученияТокен", Объект.СерверПолученияТокен);
	
	ОповещениеОбработкиТокена = Новый ОписаниеОповещения("ПолучениеТокенЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.упСервераСбораДанных.Форма.ФормаТокен",ПараметрыПолученияТокен,Элементы.Токен,,,, ОповещениеОбработкиТокена, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ПолучитьТокен

&НаКлиенте
// Процедура вызывается при закрытии формы получения токена
//
// Параметры:
//  Результат  - Структура - результат выбора.
//  ДополнительныеПараметры  - Структура - Параметры.
//
Процедура ПолучениеТокенЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат)=ТИП("Структура") Тогда
		Объект.Токен = Результат.Токен;
		Объект.СерверПолученияТокен = Результат.СерверПолученияТокен;
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных Токен'"),,
		НСтр("ru = 'Установлено новое значение Токен.'"),БиблиотекаКартинок.Информация32);
	КонецЕсли;
КонецПроцедуры // ПолучениеТокенЗавершение()

#КонецОбласти

#Область ДполнительныеПроцедурыФункции

&НаСервере
// Выполним обращение к сервису АвтоГРАФ.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Массив - Список наименований схем.
//
Функция ПолучитьСписокСхемСервиса()

	Результат = упИнтеграцияССерверамиСбораДанных.ВернутьСхемыСервисаAutoGRAPH(Объект.Сервер,Объект.Порт,Объект.Пользователь,Объект.Пароль);
	
	Возврат Результат;

КонецФункции // ПолучитьСписокСхемСервиса()

&НаСервереБезКонтекста
Функция ОпределитьТипСервераСбораДанных(Тип)

	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("AndroidКлиент", Ложь);
	СтруктураВозврата.Вставить("AutoGRAPH", Ложь);
	СтруктураВозврата.Вставить("СКАУТ", Ложь);
	СтруктураВозврата.Вставить("ЦСМ", Ложь);
	СтруктураВозврата.Вставить("Omnicomm", Ложь);
	СтруктураВозврата.Вставить("WialonPro", Ложь);
	СтруктураВозврата.Вставить("WialonHosting", Ложь);
	
	Если Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.AndroidКлиент") Тогда
		СтруктураВозврата.Вставить("AndroidКлиент", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.AutoGRAPH") Тогда
		СтруктураВозврата.Вставить("AutoGRAPH", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.СКАУТ") Тогда
		СтруктураВозврата.Вставить("СКАУТ", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.ЦСМ") Тогда
		СтруктураВозврата.Вставить("ЦСМ", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.Omnicomm") Тогда
		СтруктураВозврата.Вставить("Omnicomm", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.WialonPro") Тогда
		СтруктураВозврата.Вставить("WialonPro", Истина);
	ИначеЕсли Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.WialonHosting") Тогда
		СтруктураВозврата.Вставить("WialonHosting", Истина);
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции // ОпределитьТипСервераСбораДанных()

&НаКлиенте
// Выполним установку видимости элементов.
//
// Параметры:
//  Нет.
//
Процедура УстановитьВидимостьЭлементов()
	
	ЭтотТипОбъекта = ОпределитьТипСервераСбораДанных(Объект.Тип);
	
	Элементы.грпДополнительно.Видимость = ЭтотТипОбъекта.AutoGRAPH;
	
	ВидимостьWialonPro = ЭтотТипОбъекта.WialonPro;
	ВидимостьWialonHosting = ЭтотТипОбъекта.WialonHosting;
	ВидимостьScout = ЭтотТипОбъекта.СКАУТ;
	//Элементы.ДатаЗагрузкиScout.Видимость = ВидимостьScout;
	Элементы.ГруппаИнтервал.Видимость = ВидимостьScout;
	Элементы.ФормакмдПолучитьТССКАУТ.Видимость = ВидимостьScout;
	
	
	ВидимостьТСOMNICOMM = ЭтотТипОбъекта.Omnicomm;
	Элементы.ФормаПолучитьТСOMNICOMM.Видимость = ВидимостьТСOMNICOMM;
	Элементы.ДатаЗагрузкиScout.Видимость = ВидимостьТСOMNICOMM ИЛИ ВидимостьScout ИЛИ ВидимостьWialonPro ИЛИ ВидимостьWialonHosting;
	Элементы.ФормаПолучитьТСWialonPro.Видимость = ВидимостьWialonPro;
	Элементы.ФормаСопоставитьТрекерыWialonPro.Видимость = ВидимостьWialonPro ИЛИ ВидимостьWialonHosting;
	Элементы.ФормаПолучитьТСWialonHosting.Видимость = ВидимостьWialonHosting;
	
	Если ЭтотТипОбъекта.СКАУТ Тогда
		Элементы.Сервер.ПодсказкаВвода = "spic.scout365.ru";
		Элементы.Порт.Подсказка = "Указывается порт";
	ИначеЕсли ЭтотТипОбъекта.WialonHosting Тогда
		Элементы.Сервер.ПодсказкаВвода = "hst-api.wialon.com";
		Элементы.Порт.Подсказка = "По умолчанию порт 443";
	ИначеЕсли ЭтотТипОбъекта.WialonPro Тогда
		Элементы.Порт.Подсказка = "По умолчанию порт 8026";
		Элементы.Сервер.ПодсказкаВвода = "";
	Иначе
		Элементы.Сервер.ПодсказкаВвода = "";
		Элементы.Порт.Подсказка = "Указывается порт";
	КонецЕсли;
	
	ВидимостьWialonPro=Ложь;
	Если ЭтотТипОбъекта.AndroidКлиент Тогда
		Элементы.ДобавлятьВQRКодДанныеАутентификацииНаМобильномКлиенте.Видимость = Истина;
		Элементы.КонтактыСлужбыПоддержки.Видимость = Истина;
	Иначе
		Элементы.ДобавлятьВQRКодДанныеАутентификацииНаМобильномКлиенте.Видимость = Ложь;
		Элементы.КонтактыСлужбыПоддержки.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.грпПользователи.Видимость = НЕ ВидимостьWialonHosting;
	Элементы.грпТокен.Видимость = ВидимостьWialonHosting;
	Элементы.ЗащищенноеСоединение.Видимость = ВидимостьWialonHosting;
	
КонецПроцедуры // УстановитьВидимостьЭлементов()

&НаСервере
Процедура ПолучитьКартинкуШК()
	
	Если ЗначениеЗаполнено(Объект.Сервер) И ЗначениеЗаполнено(Объект.Порт) Тогда 
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода("srv=tcpip://" + Объект.Сервер + ":" + Формат(Объект.Порт, "ЧГ="), 0, 150);
	Иначе	
		ДанныеQRКода = Неопределено;
	КонецЕсли;	
	Картинка = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТСНаСервереСКАУТ(ТекущийДокумент)
		
	Токен = "";
	ПроксиАвторизация = Неопределено;
	
	Попытка
		
		Если НЕ ПустаяСтрока(Объект.Пользователь) Тогда	
			Токен = упИнтеграцияССерверамиСбораДанных.ПолучитьТокенScoutSOAP(ПроксиАвторизация, Объект.Пользователь, Объект.Пароль, Объект.Сервер, Объект.Порт);
			Если ПустаяСтрока(Токен) Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		тбзУстройства = упИнтеграцияССерверамиСбораДанных.ПолучитьСписокУстройствScoutSOAP(Объект.Сервер,Объект.Порт,Токен);
		ПроксиАвторизация.Logout();
		Токен = "";
		Сч = 2;
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = "№ п/п";
		ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = "Уникальный идентификатор устройства(трекера)";
		ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = "Государственный регистрационный номер";
		ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = "Наименование";
		Счч = 0;
		Для каждого ТекущаяСтрокаУстройства Из тбзУстройства Цикл
			Сч = Сч + 1;
			Счч = Счч + 1;
			ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = Счч;
			ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = ТекущаяСтрокаУстройства.Идентификатор;
			ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = ТекущаяСтрокаУстройства.РегистрационныйНомер;
			ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = ТекущаяСтрокаУстройства.Наименование;
			
		КонецЦикла;
	    
		ТекущийДокумент = ТабличныйДокумент;
	Исключение
		Если НЕ ПроксиАвторизация = Неопределено Тогда 
			ПроксиАвторизация.Logout();
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры // ПолучитьТСНаСервереСКАУТ()

&НаСервере
Процедура ПолучитьТСНаСервереOmnicomm(ТекущийДокумент)
	
	Токен = "";
	ПроксиАвторизация = Неопределено;
	
	Попытка
		Если НЕ ПустаяСтрока(Объект.Пользователь) Тогда 
			Токен = упИнтеграцияССерверамиСбораДанных.ПолучитьТокенOmnicommSOAP(ПроксиАвторизация, Объект.Пользователь, Объект.Пароль, Объект.Сервер, Объект.Порт);
			Если ПустаяСтрока(Токен) Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		тбзУстройства = упИнтеграцияССерверамиСбораДанных.ПолучитьСписокУстройствOmnicommSOAP(ПроксиАвторизация, Токен,  Объект.Ссылка);
				
		Сч = 2;
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = "№ п/п";
		ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = "Уникальный идентификатор устройства(трекера)";
		ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = "Тип транспортного средства";
		ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = "Наименование";
		ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = "Телефон";
		Счч = 0;
		Для каждого ТекущаяСтрокаУстройства Из тбзУстройства Цикл
			Сч = Сч + 1;
			Счч = Счч + 1;
			ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = Счч;
			ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = ТекущаяСтрокаУстройства.Идентификатор;
			ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = ТекущаяСтрокаУстройства.ТипТС;
			ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = ТекущаяСтрокаУстройства.Наименование;
			ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = ТекущаяСтрокаУстройства.Телефон;
			
		КонецЦикла;
	    
		ТекущийДокумент = ТабличныйДокумент;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры // ПолучитьТСНаСервереOmnicomm()

&НаСервере
Процедура ПолучитьТСНаСервереWialonPro(ТекущийДокумент)
	
	ssid = ""; // уникальный идентификатор сессии
	
	Попытка
		Если НЕ ПустаяСтрока(Объект.Пользователь) Тогда 
			РезультатОбращения = упИнтеграцияССерверамиСбораДанных.ПолучитьУникальныйИдентификаторСессииWialonPro(Объект.Сервер, Объект.Пользователь, Объект.Пароль, Объект.Порт, Объект.ЗащищенноеСоединение);
			Если РезультатОбращения=Неопределено Тогда 
				Возврат;
			КонецЕсли;
			ssid = РезультатОбращения.ssid;
		КонецЕсли;
		
		тбзУстройства = упИнтеграцияССерверамиСбораДанных.ПолучитьСписокУстройствWialonPro(Объект.Сервер, Объект.Порт, Объект.ЗащищенноеСоединение, ssid, РезультатОбращения.itemsId);
		РезультатЗавершения = упИнтеграцияССерверамиСбораДанных.ЗавершитьСессиюПодключенияWialonPro(Объект.Сервер, Объект.Порт, Объект.ЗащищенноеСоединение, ssid);
		Если НЕ РезультатЗавершения=Неопределено Тогда 
			ТекстОшибки = СтрШаблон("Для сервера сбора данных %1 завершение сессии произошло с ошибкой: %2", Объект.Сервер, РезультатЗавершения.ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Сч = 2;
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = "№ п/п";
		ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = "Уникальный идентификатор устройства(трекера)";
		//ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = "Тип транспортного средства";
		ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = "UID";
		ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = "Наименование";
		ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = "Телефон";
		Счч = 0;
		Для каждого ТекущаяСтрокаУстройства Из тбзУстройства Цикл
			Сч = Сч + 1;
			Счч = Счч + 1;
			ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = Счч;
			ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = ТекущаяСтрокаУстройства.Идентификатор;
			ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = ТекущаяСтрокаУстройства.ТипТС;
			ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = ТекущаяСтрокаУстройства.Наименование;
			ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = ТекущаяСтрокаУстройства.Телефон;
			
		КонецЦикла;
	    
		ТекущийДокумент = ТабличныйДокумент;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры // ПолучитьТСНаСервереWialonPro()

&НаКлиенте
// Выполним обращение к сервису.
//
// Параметры:
//  Результат  - Структура - результат выбора.
//  ДополнительныеПараметры  - Структура - Параметры.
//
Процедура ВыполнитьОбращениеНаСервереWialonPro(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных WialonPro'"),,
		НСтр("ru = 'Обращение к сервису WialonPro.'"),БиблиотекаКартинок.Информация32);
	
	ТекущийДокумент = Неопределено;
	ПолучитьТСНаСервереWialonPro(ТекущийДокумент);
	Если НЕ ТекущийДокумент = Неопределено Тогда 
		ТекущийДокумент.Показать("Объекты мониторинга в WialonPro");
	КонецЕсли;	
	
КонецПроцедуры // ВыполнитьОбращениеНаСервереWialonPro()

&НаКлиенте
// Выполним обращение к сервису.
//
// Параметры:
//  Результат  - Структура - результат выбора.
//  ДополнительныеПараметры  - Структура - Параметры.
//
Процедура ВыполнитьОбращениеНаСервереWialonHosting(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Получение данных WialonHosting'"),,
		НСтр("ru = 'Обращение к сервису WialonHosting.'"),БиблиотекаКартинок.Информация32);
	
	ТекущийДокумент = Неопределено;
	ПолучитьТСНаСервереWialonHosting(ТекущийДокумент);
	Если НЕ ТекущийДокумент = Неопределено Тогда 
		ТекущийДокумент.Показать("Объекты мониторинга в WialonHosting");
	КонецЕсли;	
	
КонецПроцедуры // ВыполнитьОбращениеНаСервереWialonHosting()

&НаСервере
Процедура ПолучитьТСНаСервереWialonHosting(ТекущийДокумент)
	
	sid = ""; // уникальный идентификатор сессии
	
	Попытка
		Если НЕ ПустаяСтрока(Объект.Токен) Тогда 
			РезультатОбращения = упИнтеграцияССерверамиСбораДанных.ПолучитьУникальныйИдентификаторСессииWialonHosting(Объект.Сервер, Объект.Токен, Объект.Порт, Объект.ЗащищенноеСоединение);
			Если РезультатОбращения=Неопределено Тогда 
				Возврат;
			КонецЕсли;
			sid = РезультатОбращения.sid;
		КонецЕсли;
		
		тбзУстройства = упИнтеграцияССерверамиСбораДанных.ПолучитьСписокУстройствWialonHosting(Объект.Сервер, Объект.Порт, Объект.ЗащищенноеСоединение, sid);
		РезультатЗавершения = упИнтеграцияССерверамиСбораДанных.ЗавершитьСессиюПодключенияWialonHosting(Объект.Сервер, Объект.Порт, Объект.ЗащищенноеСоединение, sid);
		Если НЕ РезультатЗавершения=Неопределено Тогда 
			ТекстОшибки = СтрШаблон("Для сервера сбора данных %1 завершение сессии произошло с ошибкой: %2", Объект.Сервер, РезультатЗавершения.ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		Сч = 2;
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = "№ п/п";
		ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = "Уникальный идентификатор устройства(трекера)";
		ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = "Тип транспортного средства";
		ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = "Наименование";
		ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = "Телефон";
		Счч = 0;
		Для каждого ТекущаяСтрокаУстройства Из тбзУстройства Цикл
			Сч = Сч + 1;
			Счч = Счч + 1;
			ТабличныйДокумент.Область(Сч,1,Сч,1).Текст = Счч;
			ТабличныйДокумент.Область(Сч,2,Сч,2).Текст = ТекущаяСтрокаУстройства.Идентификатор;
			ТабличныйДокумент.Область(Сч,3,Сч,3).Текст = ТекущаяСтрокаУстройства.ТипТС;
			ТабличныйДокумент.Область(Сч,4,Сч,4).Текст = ТекущаяСтрокаУстройства.Наименование;
			ТабличныйДокумент.Область(Сч,5,Сч,5).Текст = ТекущаяСтрокаУстройства.Телефон;
			
		КонецЦикла;
	    
		ТекущийДокумент = ТабличныйДокумент;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры // ПолучитьТСНаСервереWialonHosting()

#КонецОбласти
